# Read and write XLS and CSV files

- XLS files are Microsoft Excel files having .xls and .xlsx

In [3]:
import pandas as pd
df = pd.read_csv('weather_data.csv')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [12]:
# read excel file
df = pd.read_excel('weather_data.xlsx')
df

        day  temperature  windspeed  event
0  1/1/2017           32          6   Rain
1  1/2/2017           35          7  Sunny
2  1/3/2017           28          2   Snow
3  1/4/2017           24          7   Snow
4  1/5/2017           32          4   Rain
5  1/6/2017           31          2  Sunny

In [8]:
# write DF to csv file
df.to_csv('new.csv')   # displays index in CSV file
df.to_csv('new_noIndex.csv', index = False)    # does not display index in CSV file

In [11]:
# write DF to Excel - Excel file can have multiple sheets - we can name a particular sheet in Excel file
df.to_excel('new.xlsx', sheet_name='weather_data')

# GROUP BY

In [15]:
import pandas as pd
df = pd.read_excel('weather_data_cities.xlsx')
df # weather by cities

          day      city  temperature  windspeed   event
0  2017-01-01  new york           32          6    Rain
1  2017-01-02  new york           36          7   Sunny
2  2017-01-03  new york           28         12    Snow
3  2017-01-04  new york           33          7   Sunny
4  2017-01-01    mumbai           90          5   Sunny
5  2017-01-02    mumbai           85         12     Fog
6  2017-01-03    mumbai           87         15     Fog
7  2017-01-04    mumbai           92          5    Rain
8  2017-01-01     paris           45         20   Sunny
9  2017-01-02     paris           50         13  Cloudy
10 2017-01-03     paris           54          8  Cloudy
11 2017-01-04     paris           42         10  Cloudy

In [16]:
g = df.groupby('city')
g

In [17]:
for city, city_df in g:
    print(city)    # when we print the dataframe - the indices are intact - row numbers
    print(city_df)

mumbai
         day    city  temperature  windspeed  event
4 2017-01-01  mumbai           90          5  Sunny
5 2017-01-02  mumbai           85         12    Fog
6 2017-01-03  mumbai           87         15    Fog
7 2017-01-04  mumbai           92          5   Rain
new york
         day      city  temperature  windspeed  event
0 2017-01-01  new york           32          6   Rain
1 2017-01-02  new york           36          7  Sunny
2 2017-01-03  new york           28         12   Snow
3 2017-01-04  new york           33          7  Sunny
paris
          day   city  temperature  windspeed   event
8  2017-01-01  paris           45         20   Sunny
9  2017-01-02  paris           50         13  Cloudy
10 2017-01-03  paris           54          8  Cloudy
11 2017-01-04  paris           42         10  Cloudy

In [18]:
g.get_group('new york')

         day      city  temperature  windspeed  event
0 2017-01-01  new york           32          6   Rain
1 2017-01-02  new york           36          7  Sunny
2 2017-01-03  new york           28         12   Snow
3 2017-01-04  new york           33          7  Sunny

In [19]:
# Find maximum temperature(in F) & windspeed in each of the cities
print(g.max())

                day  temperature  windspeed  event
city
mumbai   2017-01-04           92         15  Sunny
new york 2017-01-04           36         12  Sunny
paris    2017-01-04           54         20  Sunny

In [20]:
print(g.mean())

          temperature  windspeed
city
mumbai          88.50       9.25
new york        32.25       8.00
paris           47.75      12.75

In [21]:
print(g.describe())

         temperature                                                   \
               count   mean       std   min    25%   50%    75%   max
city
mumbai           4.0  88.50  3.109126  85.0  86.50  88.5  90.50  92.0
new york         4.0  32.25  3.304038  28.0  31.00  32.5  33.75  36.0
paris            4.0  47.75  5.315073  42.0  44.25  47.5  51.00  54.0

         windspeed
             count   mean       std  min   25%   50%    75%   max
city
mumbai         4.0   9.25  5.057997  5.0  5.00   8.5  12.75  15.0
new york       4.0   8.00  2.708013  6.0  6.75   7.0   8.25  12.0
paris          4.0  12.75  5.251984  8.0  9.50  11.5  14.75  20.0

# concetenate Data Frames

In [42]:
import pandas as pd
india_weather = pd.DataFrame({
    "city": ["Mumbai", "Delhi", "Bangalore"],
    "temperature": [32, 45, 30],
    "humidity": [80, 60, 78]
})

# display the dataframe india_weather
india_weather

        city  humidity  temperature
0     Mumbai        80           32
1      Delhi        60           45
2  Bangalore        78           30

In [43]:
us_weather = pd.DataFrame({
    "city": ["San Francisco", "Seattle", "New York"],
    "temperature" : [28, 18, 21],
    "humidity": [59, 40, 58]
})

# display the dataframe us_weather
us_weather

            city  humidity  temperature
0  San Francisco        59           28
1        Seattle        40           18
2       New York        58           21

In [41]:
# concatenate 2 dataframes (one below the other)
df = pd.concat([india_weather, us_weather])
df    # copying the indices and not modifying the indices when concatenating 2 data frames

            city  humidity  temperature
0         Mumbai        80           32
1          Delhi        60           45
2      Bangalore        78           30
0  San Francisco        59           28
1        Seattle        40           18
2       New York        58           21

In [35]:
# if you want continuous index
df = pd.concat([india_weather, us_weather], ignore_index = True)
df

            city  humidity  temperature
0         Mumbai        80           32
1          Delhi        60           45
2      Bangalore        78           30
3  San Francisco        59           28
4        Seattle        40           18
5       New York        58           21

In [40]:
# concatenating 2 dataframes (side by side)
df = pd.concat([india_weather, us_weather], axis = 1)
df

        city  humidity  temperature           city  humidity  temperature
0     Mumbai        80           32  San Francisco        59           28
1      Delhi        60           45        Seattle        40           18
2  Bangalore        78           30       New York        58           21

# Merge Data Frames - JOIN command in SQL databases

In [38]:
temperature_df = pd.DataFrame({
    "city": ["Mumbai", "Delhi", "Bangalore", "Hyderabad"],
    "temperature": [32, 45, 30, 40]
})

temperature_df

        city  temperature
0     Mumbai           32
1      Delhi           45
2  Bangalore           30
3  Hyderabad           40

In [39]:
humidity_df = pd.DataFrame({
    "city": ["Delhi", "Mumbai", "Bangalore"],
    "humidity": [68, 65, 75]
})

humidity_df

        city  humidity
0      Delhi        68
1     Mumbai        65
2  Bangalore        75

In [47]:
# INNER-JOIN
# merge 2 dataframes without explicitly mentioning the index
df = pd.merge(temperature_df, humidity_df, on='city')
df

        city  temperature  humidity
0     Mumbai           32        65
1      Delhi           45        68
2  Bangalore           30        75

In [48]:
# OUTER-JOIN
df = pd.merge(temperature_df, humidity_df, on='city', how='outer')
df

        city  temperature  humidity
0     Mumbai           32      65.0
1      Delhi           45      68.0
2  Bangalore           30      75.0
3  Hyderabad           40       NaN

# Numerical Indexing (.loc vs .iloc)

- Data Frames have a default index values starting from 0. 
- Use some other index other than default indexing - mention in the parameter of pd.DataFrame()

In [50]:
df = pd.DataFrame([5, 10, 15, 20, 25, 30, 35, 40], index=[1, 3, 5, 7, 9, 11, 13, 15])
df

     0
1    5
3   10
5   15
7   20
9   25
11  30
13  35
15  40

<h3> loc : user-defined indices </h>

In [60]:
df.loc[15]   # using user-defined index value to access data

0    40
Name: 15, dtype: int64

<h3> iloc : default row number of the table </h3>

In [66]:
df.iloc[3]   # using default row number to access the value

0    20
Name: 7, dtype: int64

In [65]:
df.iloc[15]

IndexError: single positional indexer is out-of-bounds

In [68]:
df.loc[:9]

    0
1   5
3  10
5  15
7  20
9  25

In [70]:
df.iloc[:3]

    0
1   5
3  10
5  15